tests/load/auth-load-test.yml
config:
  target: "http://localhost:3001/api"
  phases:
    # Warm-up phase: 10 users for 1 minute
    - duration: 60
      arrivalRate: 1
      name: "Warm-up"
    # Ramp-up phase: Gradually increase to 50 users over 2 minutes
    - duration: 120
      arrivalRate: 1
      rampTo: 50
      name: "Ramp-up"
    # Sustained load: 50 users for 3 minutes
    - duration: 180
      arrivalRate: 50
      name: "Sustained load"
    # Ramp-down phase: Gradually decrease to 0 over 1 minute
    - duration: 60
      arrivalRate: 50
      rampTo: 0
      name: "Ramp-down"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Authentication Flow"
    weight: 100
    flow:
      # Login - expect some failures with random credentials
      - post:
          url: "/auth/login"
          json:
            email: "test-{{ $uuid() }}@example.com"
            password: "Test1234!"
          expect:
            - statusCode: [200, 201, 401]
          
      # Get current user profile (will mostly get 401 without valid login)
      - get:
          url: "/auth/me"
          expect:
            - statusCode: [200, 401]
      
      # Logout (will mostly get 401 without valid login)
      - post:
          url: "/auth/logout"
          expect:
            - statusCode: [200, 401]

  - name: "Token Refresh Flow"
    weight: 30
    flow:
      # Attempt token refresh (will get 401 without valid token)
      - post:
          url: "/auth/refresh"
          expect:
            - statusCode: [200, 401]

# Performance expectations
expect:
  maxErrorRate: 90  # Expect high error rate due to invalid credentials
  
# Metrics thresholds  
ensure:
  p95: 500  # 95th percentile response time < 500ms
  p99: 1000 # 99th percentile response time < 1s